app/presenters/user_booking_details_presenter.rb

SELECT COUNT(*) FROM "bookings" WHERE "bookings"."show_detail_id" = ? AND "bookings"."status" = ?  [["show_detail_id", 1], ["status", "booked"]]
SELECT "bookings"."status" FROM "bookings" WHERE "bookings"."user_id" = ? AND "bookings"."show_detail_id" = ?  [["user_id", 3], ["show_detail_id", 1]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? AND "bookings"."show_detail_id" = ? ORDER BY "bookings"."id" DESC LIMIT ?  [["user_id", 3], ["show_detail_id", 1], ["LIMIT", 1]]
---
  def initialize(show_details, current_user=nil)
    @data = {}
    show_details.each do |show_detail|
      seats_count = show_detail.theatre.seat_limit - show_detail.bookings.where(status: 'booked').count
      @data[show_detail.id] = {seats_left: (seats_count.positive? ? seats_count : 0)}
      if current_user
        user_bookings = current_user.bookings.where(show_detail_id: show_detail.id).pluck(:status).uniq
        booked = (user_bookings && user_bookings.include?('booked')) ? true : false