app/controllers/bookings_controller.rb

  def index
    @bookings = current_user.bookings.order("id desc")
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? ORDER BY id desc  [["user_id", 1]]

  def new
    @booking = Booking.new
    @show_detail = ShowDetail.find_by_id(params[:show_detail_id])
---
SELECT  "show_details".* FROM "show_details" WHERE "show_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @booking = current_user.bookings.create(booking_params)
    @booking.status = 'booked'
    respond_to do |format|
      if @booking.save
        format.html { redirect_to @booking, notice: 'Booking was successfully created.' }
        format.json { render :show, status: :created, location: @booking }
      else
        show_detail = ShowDetail.find(booking_params[:show_detail_id])
        format.html { redirect_to movie_show_details_path(movie_id: show_detail.movie_id), notice: @booking.errors.messages[:error].join(',') }
---
INSERT INTO "bookings" ("user_id", "show_detail_id", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["show_detail_id", 7], ["total", 150.0], ["created_at", "2020-05-11 04:05:09.805507"], ["updated_at", "2020-05-11 04:05:09.805507"]]
INSERT INTO "bookings" ("user_id", "show_detail_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["show_detail_id", 1], ["created_at", "2020-05-10 07:38:40.087103"], ["updated_at", "2020-05-10 07:38:40.087103"]]
UPDATE "bookings" SET "status" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["status", "booked"], ["updated_at", "2020-05-10 18:31:01.087248"], ["id", 34]]
SELECT  "show_details".* FROM "show_details" WHERE "show_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def cancel
    @booking.update(status: 'cancelled')
---
UPDATE "bookings" SET "status" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["status", "cancelled"], ["updated_at", "2020-05-10 18:31:25.430217"], ["id", 35]]

    def set_booking
      @booking = current_user.bookings.find_by_id(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? AND "bookings"."id" = ? LIMIT ?  [["user_id", 5], ["id", 28], ["LIMIT", 1]]