app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" INNER JOIN "show_details" ON "show_details"."movie_id" = "movies"."id" WHERE (show_details.date >= '2020-05-10')
---
  def index
	@movies = Movie.joins(:show_details).where("show_details.date >= ?", Date.today).group(:id)