app/controllers/show_details_controller.rb

  def index
    if params[:movie_id]
      @show_details = ShowDetail.where(movie_id: params[:movie_id])
---
SELECT "show_details".* FROM "show_details" WHERE "show_details"."movie_id" = ?  [["movie_id", 1]]

    def set_show_detail
      @show_detail = ShowDetail.find_by_id(params[:id])
---
SELECT  "show_details".* FROM "show_details" WHERE "show_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]