app/controllers/theatres_controller.rb

SELECT "theatres".* FROM "theatres"
---
  def index
    @theatres = Theatre.all