app/models/booking.rb

SELECT COUNT(*) FROM "bookings" WHERE "bookings"."show_detail_id" = ? AND "bookings"."status" = ?  [["show_detail_id", 2], ["status", "booked"]]
---
  def sold_out
  	seats_left = show_detail.theatre.seat_limit - show_detail.bookings.where(status: 'booked').count